# Pandas

In [2]:
import numpy as np
import pandas as pd

## Series

In [4]:
label = ['a', 'b', 'c']
info = [1, 2, 3]
pd.Series(data = info, index = label)

a    1
b    2
c    3
dtype: int64

In [9]:
array = np.arange(5, 8)
labels = ['venta1', 'venta2', 'venta3']
serie = pd.Series(array, labels)

In [10]:
serie

venta1    5
venta2    6
venta3    7
dtype: int32

In [12]:
serie['venta2']

6

In [13]:
serie[2]

7

In [14]:
info2 = ['tech', 500, 'printer', 600, 'a']
info2

['tech', 500, 'printer', 600, 'a']

In [15]:
pd.Series(info2)

0       tech
1        500
2    printer
3        600
4          a
dtype: object

In [18]:
serie2 = pd.Series([1, 2, 3], ['a', 'b', 'v'])
serie3 = pd.Series([4, 5, 6], ['a', 'b', 'v'])

In [19]:
serie_add = serie2 + serie3

In [20]:
serie_add

a    5
b    7
v    9
dtype: int64

## DataFrames

In [21]:
rows = ['sale1', 'sale2', 'sale3']
columns = ['ZoneA', 'zoneB', 'zoneC']
dat = [[574, 558, 965], [856, 899, 204], [666, 574, 624]]

In [22]:
dataframe = pd.DataFrame(dat, rows, columns)

In [23]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [24]:
dataframe.loc['sale2']

ZoneA    856
zoneB    899
zoneC    204
Name: sale2, dtype: int64

In [27]:
dataframe.loc[['sale1', 'sale3']]

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale3    666    574    624

In [30]:
dataframe['ZoneA']

sale1    574
sale2    856
sale3    666
Name: ZoneA, dtype: int64

In [31]:
dataframe.loc['sale1']['ZoneA']

574

In [32]:
dataframe['total_sales'] = dataframe['ZoneA'] + dataframe['zoneB'] + dataframe['zoneC']

In [33]:
dataframe

       ZoneA  zoneB  zoneC  total_sales
sale1    574    558    965         2097
sale2    856    899    204         1959
sale3    666    574    624         1864

In [36]:
dataframe.drop('total_sales', axis = 1)

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [37]:
dataframe

       ZoneA  zoneB  zoneC  total_sales
sale1    574    558    965         2097
sale2    856    899    204         1959
sale3    666    574    624         1864

In [38]:
dataframe.drop('total_sales', axis = 1, inplace = True)

In [39]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [40]:
dataframe.drop('sale3')

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204

In [41]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [42]:
dataframe.drop('sale3', inplace = True)

In [43]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204

In [44]:
dataframe.shape

(2, 3)

### Select Data with a condition

In [45]:
rows = 'sale1 sale2 sale3'.split()
rows

['sale1', 'sale2', 'sale3']

In [47]:
columns = 'zoneA zoneB zoneC'.split()
columns

['zoneA', 'zoneB', 'zoneC']

In [48]:
info = [[5555, 5885, 9954], [5741, 2365, 9874], [5471, 5657, 2410]]
info

[[5555, 5885, 9954], [5741, 2365, 9874], [5471, 5657, 2410]]

In [49]:
dataframe = pd.DataFrame(info, rows, columns)

In [50]:
dataframe

       zoneA  zoneB  zoneC
sale1   5555   5885   9954
sale2   5741   2365   9874
sale3   5471   5657   2410

In [51]:
condition = dataframe > 5000

In [52]:
dataframe[condition]

       zoneA   zoneB   zoneC
sale1   5555  5885.0  9954.0
sale2   5741     NaN  9874.0
sale3   5471  5657.0     NaN

In [55]:
condition2 = (dataframe['zoneA'] > 5500) & (dataframe['zoneB'] > 5700)

In [56]:
dataframe[condition2]

       zoneA  zoneB  zoneC
sale1   5555   5885   9954

### Modify row names

In [58]:
rows = 'sale1 sale2 sale3'.split()
columns = 'zoneA zoneB zoneC'.split()
info = [[5555, 5885, 9954], [5741, 2365, 9874], [5471, 5657, 2410]]
dataframe = pd.DataFrame(info, rows, columns)

In [59]:
dataframe

       zoneA  zoneB  zoneC
sale1   5555   5885   9954
sale2   5741   2365   9874
sale3   5471   5657   2410

In [60]:
row_new = 'day1 day2 day3'.split()

In [61]:
dataframe['days'] = row_new

In [62]:
dataframe

       zoneA  zoneB  zoneC  days
sale1   5555   5885   9954  day1
sale2   5741   2365   9874  day2
sale3   5471   5657   2410  day3

In [63]:
dataframe.set_index('days')

      zoneA  zoneB  zoneC
days
day1   5555   5885   9954
day2   5741   2365   9874
day3   5471   5657   2410

In [64]:
dataframe

       zoneA  zoneB  zoneC  days
sale1   5555   5885   9954  day1
sale2   5741   2365   9874  day2
sale3   5471   5657   2410  day3

In [65]:
dataframe = dataframe.set_index('days')

In [66]:
dataframe

      zoneA  zoneB  zoneC
days
day1   5555   5885   9954
day2   5741   2365   9874
day3   5471   5657   2410

### Null data

In [67]:
dictionary = {'a': [4, 5, np.nan], 'b': [6, 1, 5], 'c': [np.nan, 4, np.nan]}

In [68]:
dataframe2 = pd.DataFrame(dictionary)

In [69]:
dataframe2

     a  b    c
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [70]:
dataframe2.dropna()

     a  b    c
1  5.0  1  4.0

In [71]:
dataframe2.dropna(axis = 1)

   b
0  6
1  1
2  5

In [ ]:
dataframe.